src/BusinessProcesses/КАЗ_СогласованиеЗаявкиБП/КАЗ_СогласованиеЗаявкиБП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:BusinessProcess>
  <name>КАЗ_СогласованиеЗаявкиБП</name>
  <task>Task.КАЗ_ЗадачаСогласования</task>
  <attributes>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.КАЗ_ЗаявкаНаОплату</types>
    </type>
  </attributes>
</mdclass:BusinessProcess>

src/Documents/КАЗ_СогласованиеЗаявки/КАЗ_СогласованиеЗаявки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КАЗ_СогласованиеЗаявки</name>
  <attributes>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.КАЗ_ЗаявкаНаОплату</types>
    </type>
  </attributes>
  <attributes>
    <name>Решение</name>
    <type>
      <types>EnumRef.КАЗ_РешенияСогласования</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Согласующий</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРешения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Document>

src/Catalogs/КАЗ_МаршрутыСогласования/КАЗ_МаршрутыСогласования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КАЗ_МаршрутыСогласования</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Активен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГраницаСуммыОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГраницаСуммыДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/КАЗ_ЭтапыМаршрутаСогласования/КАЗ_ЭтапыМаршрутаСогласования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КАЗ_ЭтапыМаршрутаСогласования</name>
  <owners>Catalog.КАЗ_МаршрутыСогласования</owners>
  <attributes>
    <name>НомерЭтапа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Согласующий</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательныйЭтап</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/BusinessProcesses/КАЗ_СогласованиеЗаявкиБП/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.КАЗ_ЗаявкаНаОплату") Тогда
		Заявка = ДанныеЗаполнения;
	КонецЕсли;

КонецПроцедуры

#Область ОбработчикиСобытийЭлементовКартыМаршрута

// Параметры:
//   ТочкаМаршрутаБизнесПроцесса - ТочкаМаршрутаБизнесПроцессаСсылка.КАЗ_СогласованиеЗаявкиБП
//   ФормируемыеЗадачи - Массив из ЗадачаОбъект.КАЗ_ЗадачаСогласования
//   Отказ - Булево
//
Процедура СогласоватьПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)

	Согласующий = НайтиСогласующегоПоСуммеЗаявки(Заявка);

	Для Каждого Задача Из ФормируемыеЗадачи Цикл
		Задача.Заявка = Заявка;
		Задача.НомерЭтапа = 1;
		Задача.Согласующий = Согласующий;
		Задача.Исполнитель = Согласующий;
		Задача.Наименование = "Согласование заявки " + Заявка;
	КонецЦикла;

КонецПроцедуры

// Параметры:
//   ТочкаМаршрутаБизнесПроцесса - ТочкаМаршрутаБизнесПроцессаСсылка.КАЗ_СогласованиеЗаявкиБП
//   Задача - ЗадачаСсылка.КАЗ_ЗадачаСогласования
//   Отказ - Булево
//
// Связка с документом КАЗ_СогласованиеЗаявки: при выполнении задачи (форма
// задачи ФормаЗадачи, кнопка "Завершить с решением") здесь создается и
// проводится документ согласования по решению, указанному в задаче. Все
// последующие изменения статуса заявки и запись в регистр
// КАЗ_ИсторияСогласования делает сам документ при проведении - дублировать
// эту логику здесь не нужно.
Процедура СогласоватьПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)

	Если Не ЗначениеЗаполнено(Заявка) Тогда
		Возврат;
	КонецЕсли;

	ОбъектЗадачи = Задача.ПолучитьОбъект();

	Если Не ЗначениеЗаполнено(ОбъектЗадачи.Решение) Тогда
		Сообщить("Не указано решение по задаче согласования - документ согласования не создан.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	ДокументСогласования = Документы.КАЗ_СогласованиеЗаявки.СоздатьДокумент();
	ДокументСогласования.Дата = ТекущаяДата();
	ДокументСогласования.Заявка = Заявка;
	ДокументСогласования.НомерЭтапа = ОбъектЗадачи.НомерЭтапа;
	ДокументСогласования.Согласующий = ОбъектЗадачи.Согласующий;
	ДокументСогласования.Решение = ОбъектЗадачи.Решение;
	ДокументСогласования.ДатаРешения = ТекущаяДата();
	ДокументСогласования.Записать(РежимЗаписиДокумента.Проведение);

КонецПроцедуры

Процедура ЗавершениеПриЗавершении(ТочкаМаршрутаБизнесПроцесса, Отказ)

КонецПроцедуры

#КонецОбласти

// Находит согласующего для заявки: сначала подбирает маршрут по диапазону суммы
// заявки (Активен, ГраницаСуммыОт/До), затем берет согласующего первого этапа
// этого маршрута. Упрощенная реализация - без ветвления по нескольким этапам,
// этого достаточно для рабочего единственного шага согласования.
Функция НайтиСогласующегоПоСуммеЗаявки(Заявка)

	Если Не ЗначениеЗаполнено(Заявка) Тогда
		Возврат Справочники.Пользователи.ПустаяСсылка();
	КонецЕсли;

	Сумма = Заявка.СуммаДокумента;

	ЗапросМаршрута = Новый Запрос;
	ЗапросМаршрута.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Маршруты.Ссылка КАК Маршрут
	|ИЗ
	|	Справочник.КАЗ_МаршрутыСогласования КАК Маршруты
	|ГДЕ
	|	Маршруты.Активен
	|	И НЕ Маршруты.ПометкаУдаления
	|	И НЕ Маршруты.ЭтоГруппа
	|	И Маршруты.ГраницаСуммыОт <= &Сумма
	|	И (Маршруты.ГраницаСуммыДо = 0 ИЛИ Маршруты.ГраницаСуммыДо >= &Сумма)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Маршруты.ГраницаСуммыОт УБЫВ";

	ЗапросМаршрута.УстановитьПараметр("Сумма", Сумма);

	ВыборкаМаршрута = ЗапросМаршрута.Выполнить().Выбрать();

	Если Не ВыборкаМаршрута.Следующий() Тогда
		Возврат Справочники.Пользователи.ПустаяСсылка();
	КонецЕсли;

	ЗапросЭтапа = Новый Запрос;
	ЗапросЭтапа.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Этапы.Согласующий КАК Согласующий
	|ИЗ
	|	Справочник.КАЗ_ЭтапыМаршрутаСогласования КАК Этапы
	|ГДЕ
	|	Этапы.Владелец = &Маршрут
	|	И НЕ Этапы.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Этапы.НомерЭтапа";

	ЗапросЭтапа.УстановитьПараметр("Маршрут", ВыборкаМаршрута.Маршрут);

	ВыборкаЭтапа = ЗапросЭтапа.Выполнить().Выбрать();

	Если ВыборкаЭтапа.Следующий() Тогда
		Возврат ВыборкаЭтапа.Согласующий;
	КонецЕсли;

	Возврат Справочники.Пользователи.ПустаяСсылка();

КонецФункции
